Repository: George-br/TeleNVDA
Catalog: addon/locale/*/LC_MESSAGES/nvda.po
Languages: uk

source: NVDA Remote has been detected on your NVDA installation. In order for TeleNVDA to work without conflicts, NVDA Remote must be disabled. Otherwise, TeleNVDA will refuse to work. Would you like to disable NVDA Remote now?
uk: У вашій інсталяції NVDA виявлено додаток віддаленого керування. Для того, щоб TeleNVDA працював без конфліктів, додаток віддаленого керування необхідно вимкнути. Інакше TeleNVDA не буде працювати. Ви хочете вимкнути віддалене керування зараз?

source: Running NVDA Remote detected
uk: Виявлено запуск віддалена підтримка

source: Your NVDA Remote configuration was corrupted and has been reset.
uk: Вашу конфігурацію віддаленого керування NVDA було пошкоджено та повернуто до початкових налаштувань.

source: NVDA Remote Configuration Error
uk: Помилка конфігурації віддаленого керування NVDA

source: Connect...
uk: З'єднати...

source: Remotely connect to another computer running NVDA Remote Access or TeleNVDA
uk: Віддалено підключіться до іншого комп’ютера, на якому запущено NVDA Remote Access або TeleNVDA

source: Disconnect
uk: Перервати

source: Disconnect from another computer running NVDA Remote Access or TeleNVDA
uk: Від’єднайтеся від іншого комп’ютера, на якому запущено NVDA Remote Access або TeleNVDA

source: Mute remote
uk: Вимкнути звук віддаленого комп'ютера

source: Mute speech and sounds from the remote computer
uk: Вимкнення мовлення та звуків віддаленого комп'ютера

source: &Push clipboard
uk: Передати &буфер обміну

source: Push the clipboard to the other machine
uk: Надсилає вміст буфера обміну на віддалений комп'ютер

source: Send &file...
uk: Надіслати &файл...

source: Send a file to the other machine
uk: Надіслати файл на інший комп'ютер

source: NVDA &Remote protocol (recommended)
uk: Протокол NVDA &Remote (рекомендовано)

source: Copy a link to the remote session compatible with both NVDA Remote and TeleNVDA
uk: Копіювати посилання на віддалений сеанс, сумісний з NVDA Remote і TeleNVDA

source: &TeleNVDA protocol
uk: Протокол &TeleNVDA

source: Copy a link to the remote session compatible only with TeleNVDA
uk: Копіювати посилання на віддалений сеанс, сумісний лише з TeleNVDA

source: Copy &link
uk: &Копіювати посилання

source: Copy a link to the remote session
uk: Копіює посилання на сеанс віддаленого керування

source: &Options...
uk: &Параметри...

source: Options
uk: Параметри

source: Send Ctrl+Alt+Del
uk: Надіслати Ctrl + Alt + Del

source: R&emote
uk: Віддалене &керування

source: Are you sure you want to disconnect the controlled computer?
uk: Ви впевнені, що хочете від'єднати керований комп'ютер?

source: Warning!
uk: Увага!

source: Unmute remote
uk: Вимкнути звук віддаленого комп'ютера

source: Unmute speech and sounds from the remote computer
uk: Увімкнення мовлення та звуків віддаленого комп'ютера

source: Not connected.
uk: Не під'єднано.

source: Choose the file you want to send to the remote computer
uk: Виберіть файл, який потрібно надіслати на віддалений комп’ютер

source: All files (*.*)
uk: Всі файли (*.*)

source: This file is too large. Only files smaller than 10 MB are supported.
uk: Цей файл завеликий. Підтримуються лише файли розміром менше 10 МБ.

source: Error
uk: Помилка

source: The session will be blocked until the transfer is complete. Are you sure you want to continue?
uk: Сеанс буде заблоковано до завершення надсилання. Ви впевнені, що бажаєте продовжити?

source: File sent
uk: Файл надіслано

source: Sends the specified file to the remote machine
uk: Надсилає вибраний файл на віддалений компьютер

source: Sends the contents of the clipboard to the remote machine
uk: Надсилає вміст буфера обміну на віддалений компьютер

source: Clipboard pushed
uk: Буфер обміну передано

source: Unable to push clipboard
uk: Неможливо передати буфер обміну

source: Ctrl+Alt+Delete has been sent to the remote machine
uk: Ctrl+Alt+Delete надіслано на віддалений компьютер

source: Disconnected!
uk: Перервати!

source: Error Connecting
uk: Помилка з'єднання

source: Unable to connect to the remote computer
uk: Не вдається під'єднатися до віддаленого комп'ютера

source: Connect
uk: З'єднання

source: Connected!
uk: З'єднано!

source: Connection interrupted
uk: З'єднання перервано

source: The option to handle keys from other applications is disabled in your NVDA keyboard settings. In order to allow the keyboard of this machine to be controlled, this option should be enabled. Would you like to do this now?
uk: У налаштуваннях клавіатури NVDA вимкнено опцію опрацьовувати клавіші з інших програм. Щоб дозволити керування клавіатурою цього пристрою, цю опцію слід увімкнути. Бажаєте зробити це зараз?

source: Warning
uk: Увага

source: Connected to control server
uk: Під'єднано до керівного сервера

source: TeleNVDA is already connected. Disconnect before opening a new connection.
uk: TeleNVDA вже підключено. Відключіться перед тим, як створити нове з'єднання.

source: TeleNVDA Already Connected
uk: TeleNVDA вже підключено

source: Do you wish to control the machine on server {server} with key {key}?
uk: Ви бажаєте керувати комп'ютером на сервері {server} за допомогою ключа {key}?

source: Do you wish to allow this machine to be controlled on server {server} with key {key}?
uk: Чи бажаєте ви, щоб цим комп'ютером керували на сервері {server} за допомогою ключа {key}?

source: TeleNVDA Connection Request
uk: Запит на підключення TeleNVDA

source: Copies a link to the remote session to the clipboard compatible with both NVDA Remote and TeleNVDA
uk: Копіює посилання на віддалений сеанс, сумісний з TeleNVDA і NVDA Remote, в буфер обміну

source: Copied link
uk: Посилання скопійовано

source: Copies a link to the remote session to the clipboard compatible only with TeleNVDA
uk: Копіює посилання на віддалений сеанс, сумісний лише з TeleNVDA, в буфер обміну

source: Opens a dialog to start a remote session
uk: Відкриває діалог для запуску віддаленого сеансу

source: Disconnect a remote session
uk: Перервати віддалений сеанс

source: Set the host to ignore the next gesture completely, sending next gesture to the guest as is. Useful when you need to use the gesture asigned to toggle between guest and host, in the guest machine.
uk: Дозволяє хосту повністю ігнорувати наступний жест, надсилаючи наступний жест гостю як є. Корисно, якщо вам потрібно використовувати призначений жест для перемикання між гостем і хостом на гостьовій машині.

source: Send next gesture to the guest
uk: Надіслати наступний жест гостю

source: Toggles the control between guest and host machine
uk: Перемикає керування між локальним і віддаленим компьютером

source: Controlling remote machine.
uk: Керування віддаленим комп'ютером.

source: Controlling local machine.
uk: Керування локальним комп'ютером.

source: Mute or unmute the speech coming from the remote computer
uk: Вимикає або вмикає мовлення з віддаленого комп'ютера

source: Sends Ctrl+Alt+Delete to the remote machine
uk: Надсилає Ctrl+Alt+Delete на віддалений компьютер

source: Opens the addon settings panel inside NVDA settings dialog
uk: Відкриває панель налаштувань додатка в діалозі налаштувань NVDA

source: &Host:
uk: &Хост:

source: &Key:
uk: &Ключ:

source: &Generate Key
uk: &Створити ключ

source: Host must be set.
uk: Необхідно вказати сервер.

source: Get External &IP
uk: &Отримати зовнішню IP-адресу

source: &External IP:
uk: Зовнішня IP-&адреса:

source: &Port:
uk: &Порт:

source: Use &UPNP to forward this port if possible
uk: Використовувати &UPNP для переспрямування цього порта якщо можливо

source: Would you like to use UPNP to forward the chosen port before detecting your IP address?
uk: Бажаєте використовувати UPNP для переспрямування обраного порту перед визначенням вашої IP-адреси?

source: Do you want to use UPNP?
uk: Хочете використати UPNP?

source: Successfully retrieved IP address. Port {port} is open.
uk: Зовнішню IP-адресу успішно отримано. Порт {port} відкритий.

source: Success
uk: Операція успішно виконана

source: Retrieved external IP, but port {port} is not currently forwarded.
uk: Зовнішню IP-адресу отримано, але порт {port} наразі не перенаправляється.

source: Unable to contact portcheck server or UPNP device, please manually retrieve your IP address and forward ports if required. See the NVDA log for more details.
uk: Не вдається зв'язатися з сервером служби перевірки портів або пристроєм UPNP, будь ласка, отримайте вручну вашу IP-адресу та переспрямуйте порти, якщо потрібно. Докладнішу інформацію див. у журналі NVDA.

source: Client
uk: Клієнт

source: Server
uk: Сервер

source: Control another machine
uk: Керувати іншим комп'ютером

source: Allow this machine to be controlled
uk: Дозволити керувати цим комп'ютером

source: Both host and key must be set.
uk: Необхідно вказати адресу сервера та ключ.

source: Both port and key must be set.
uk: Необхідно вказати порт та ключ.

source: Auto-connect to control server on startup
uk: Автопід'єднання до керівного сервера під час запуску

source: Use Remote Control Server
uk: Використовувати віддалений керівний сервер

source: Host Control Server
uk: Локальний керівний сервер

source: Play sounds instead of beeps
uk: Відтворювати звуки замість сигналів

source: Display an alert before the controlled computer disconnects
uk: Показувати сповіщення перед відключенням керованого комп’ютера

source: Mute remote speech when controlling local machine
uk: Вимкнути віддалене мовлення під час керування локальним компьютером

source: Process speech commands when controlling another computer
uk: Обробляти мовні команди під час керування іншим комп’ютером

source: Portcheck &service URL:
uk: Адреса &служби перевірки портів:

source: Delete all trusted fingerprints
uk: Видалення всіх надійних відбитків

source: When connecting to an unauthorized server, you will again be prompted to accepts its certificate.
uk: Під час під'єднання до неавторизованого сервера вам знову буде запропоновано прийняти його сертифікат.

source: Are you sure you want to delete all stored trusted fingerprints?
uk: Ви впевнені, що хочете видалити всі збережені надійні відбитки?

source: Invalid format for portcheck service URL. You must include {port} somewhere.
uk: Неправильний формат адреси служби перевірки портів. Ви повинні вказати якийсь {port}.

source: TeleNVDA Connection Security Warning
uk: Попередження про безпеку з'єднання TeleNVDA

source: Warning! The certificate of this server could not be verified. This connection may not be secure. It is possible that someone is trying to overhear your communication. Before continuing please make sure that the following server certificate fingerprint is a proper one. If you have any questions, please contact the server administrator. Server SHA256 fingerprint: {fingerprint} Do you want to continue connecting?
uk: УВАГА! Не вдалося перевірити сертифікат цього сервера. Це з'єднання може бути небезпечним. Не виключено, що хтось намагається підслухати вашу розмову. Перед продовженням, переконайтеся, що наведений нижче відбиток сертифіката сервера є правильним. Якщо у вас виникли запитання, зверніться до адміністратора сервера. Відбиток сервера SHA256: {fingerprint} Бажаєте продовжити з'єднання?

source: Connect and do not ask again for this server
uk: Під'єднатися й більше не запитувати для цього сервера

source: Clipboard updated
uk: Буфер обміну оновлено

source: No permission on device to trigger CTRL+ALT+DEL from remote
uk: На пристрої немає дозволу на віддалений запуск CTRL+ALT+DEL

source: Choose where to save the received file
uk: Виберіть місце для збереження отриманого файлу

source: File received
uk: Файл отримано

source: The version of the relay server which you have connected to is not compatible with this version of the Remote Client. Please either use a different server or upgrade your version of the addon.
uk: Версія сервера ретрансляції, до якого ви під'єднані не сумісна з цією версією клієнта віддаленого керування. Будь ласка скористайтесь іншим сервером або оновіть ваш додаток NVDA Remote.

source: Message of the Day
uk: Повідомлення дня

source: Remote NVDA not connected.
uk: Віддалене керування NVDA не під'єднано.

source: Invalid URL
uk: Неправильна URL-адреса

source: Unable to parse url "%s"
uk: Неможливо розібрати URL-адресу "%s"

source: Tele NVDA remote assistance
uk: Віддалена підтримка Tele NVDA

source: Allows remote control of and remote access to another machine. This add-on is based on NVDA Remote.
uk: Дозволяє віддалено керувати іншим комп'ютером і отримувати до нього доступ. Цей додаток базується на NVDA Remote.
